---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.StructConnectionBeamEnd
source: html/16145d2b-26b8-30b4-8c79-bae2f89165c3.htm
---
# Autodesk.Revit.DB.ParameterTypeId.StructConnectionBeamEnd Property

"End Connection"

## Syntax (C#)
```csharp
public static ForgeTypeId StructConnectionBeamEnd { get; }
```